Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: The database migration performs `ALTER ROLE <https://www.postgresql.org/docs/16/sql-alterrole.html>`_ on the database role used by Weblate. In most cases, the name of the role matches the username. In more complex setups the role name is different from the username, and you will get an error about non-existing role during the database migration (``psycopg2.errors.UndefinedObject: role "weblate@hostname" does not exist``). This is known to happen with Azure Database for PostgreSQL, but it's not limited to this environment. Please set ``ALTER_ROLE`` to change the name of the role Weblate should alter during the database migration.
sv: Databasmigreringen utfÃ¶r `ALTER ROLE <https://www.postgresql.org/docs/16/sql-alterrole.html>`_ pÃ¥ den databasroll som anvÃ¤nds av Weblate. I de flesta fall matchar rollens namn anvÃ¤ndarnamnet. I mer komplexa installationer skiljer sig rollnamnet frÃ¥n anvÃ¤ndarnamnet, och du kommer att fÃ¥ ett felmeddelande om en icke-existerande roll under databasmigreringen (``psycopg2.errors.UndefinedObject: rollen "weblate@hostname" finns inte``). Detta Ã¤r kÃ¤nt fÃ¶r att intrÃ¤ffa med Azure Database for PostgreSQL, men det Ã¤r inte begrÃ¤nsat till denna miljÃ¶. StÃ¤ll in ``ALTER_ROLE`` fÃ¶r att Ã¤ndra namnet pÃ¥ den roll som Weblate ska Ã¤ndra under databasmigreringen.

source: MySQL and MariaDB
sv: MySQL och MariaDB

source: While MySQL and MariaDB support is still maintained in Weblate, our primary focus is PostgreSQL. It is recommended to use PostgreSQL for new installs, and to migrate existing installs to PostgreSQL, see :ref:`database-migration`.
sv: Ãven om MySQL och MariaDB fortfarande stÃ¶ds i Weblate, Ã¤r vÃ¥rt huvudfokus PostgreSQL. Vi rekommenderar att du anvÃ¤nder PostgreSQL fÃ¶r nya installationer och migrerar befintliga installationer till PostgreSQL, se :ref:`database-migration`.

source: Some Weblate features will perform better with :ref:`postgresql`. This includes searching and translation memory, which both utilize full-text features in the database and PostgreSQL implementation is superior.
sv: Vissa Weblate-funktioner fungerar bÃ¤ttre med :ref:`postgresql`. Detta gÃ¤ller bland annat sÃ¶kning och Ã¶versÃ¤ttningsminne, som bÃ¥da anvÃ¤nder fulltextfunktioner i databasen, och PostgreSQL-implementeringen Ã¤r Ã¶verlÃ¤gsen.

source: Weblate can be also used with MySQL or MariaDB, please see :ref:`django:mysql-notes` and :ref:`django:mariadb-notes` for caveats using Django with those. Because of the limitations it is recommended to use :ref:`postgresql` for new installations.
sv: Weblate kan ocksÃ¥ anvÃ¤ndas med MySQL eller MariaDB. Se :ref:`django:mysql-notes` och :ref:`django:mariadb-notes` fÃ¶r varningar om anvÃ¤ndning av Django med dessa. PÃ¥ grund av begrÃ¤nsningarna rekommenderas det att anvÃ¤nda :ref:`postgresql` fÃ¶r nya installationer.

source: Weblate requires MySQL at least 8 or MariaDB at least 10.5.
sv: Weblate krÃ¤ver MySQL minst 8 eller MariaDB minst 10.5.

source: Following configuration is recommended for Weblate:
sv: FÃ¶ljande konfiguration rekommenderas fÃ¶r Weblate:

source: Use the ``utf8mb4`` charset to allow representation of higher Unicode planes (for example emojis).
sv: AnvÃ¤nd teckenuppsÃ¤ttningen ``utf8mb4`` fÃ¶r att mÃ¶jliggÃ¶ra representation av hÃ¶gre Unicode-plan (till exempel emojis).

source: Configure the server with ``innodb_large_prefix`` to allow longer indices on text fields.
sv: Konfigurera servern med ``innodb_large_prefix`` fÃ¶r att tillÃ¥ta lÃ¤ngre index pÃ¥ textfÃ¤lt.

source: Set the isolation level to ``READ COMMITTED``.
sv: StÃ¤ll in isoleringsnivÃ¥n till ``READ COMMITTED``.

source: The SQL mode should be set to ``STRICT_TRANS_TABLES``.
sv: SQL-lÃ¤get bÃ¶r stÃ¤llas in pÃ¥ ``STRICT_TRANS_TABLES``.

source: MySQL 8.x, MariaDB 10.5.x or newer have reasonable default configuration so that no server tweaking should be necessary and all what is needed can be configured on the client side.
sv: MySQL 8.x, MariaDB 10.5.x eller nyare har rimliga standardinstÃ¤llningar, sÃ¥ att ingen serverjustering bÃ¶r behÃ¶vas och allt som behÃ¶vs kan konfigureras pÃ¥ klientsidan.

source: Below is an example :file:`/etc/my.cnf.d/server.cnf` for a server with 8 GB of RAM. These settings should be sufficient for most installs. MySQL and MariaDB have tunables that will increase the performance of your server that are considered not necessary unless you are planning on having large numbers of concurrent users accessing the system. See the various vendors documentation on those details.
sv: Nedan fÃ¶ljer ett exempel :file:`/etc/my.cnf.d/server.cnf` fÃ¶r en server med 8 GB RAM. Dessa instÃ¤llningar bÃ¶r vara tillrÃ¤ckliga fÃ¶r de flesta installationer. MySQL och MariaDB har instÃ¤llningar som Ã¶kar serverns prestanda, men dessa anses inte nÃ¶dvÃ¤ndiga om du inte planerar att ha ett stort antal samtidiga anvÃ¤ndare som anvÃ¤nder systemet. Se dokumentationen frÃ¥n de olika leverantÃ¶rerna fÃ¶r mer information om detta.

source: It is absolutely critical to reduce issues when installing that the setting ``innodb_file_per_table`` is set properly and MySQL/MariaDB restarted before you start your Weblate install.
sv: Det Ã¤r absolut nÃ¶dvÃ¤ndigt att minska problemen vid installationen genom att se till att instÃ¤llningen ``innodb_file_per_table`` Ã¤r korrekt instÃ¤lld och att MySQL/MariaDB startas om innan du pÃ¥bÃ¶rjar installationen av Weblate.

source: In case you are getting ``#1071 - Specified key was too long; max key length is 767 bytes`` error, please update your configuration to include the ``innodb`` settings above and restart your install.
sv: Om du fÃ¥r felmeddelandet ``#1071 - Angiven nyckel var fÃ¶r lÃ¥ng; maximal nyckellÃ¤ngd Ã¤r 767 byte``, uppdatera din konfiguration sÃ¥ att den inkluderar instÃ¤llningarna fÃ¶r ``innodb`` ovan och starta om installationen.

source: In case you are getting ``#2006 - MySQL server has gone away`` error, configuring :setting:`django:CONN_MAX_AGE` might help.
sv: Om du fÃ¥r felmeddelandet ``#2006 - MySQL-servern har fÃ¶rsvunnit`` kan det hjÃ¤lpa att konfigurera :setting:`django:CONN_MAX_AGE`.

source: Configuring Weblate to use MySQL/MariaDB
sv: Konfigurera Weblate fÃ¶r att anvÃ¤nda MySQL/MariaDB

source: The :file:`settings.py` snippet for MySQL and MariaDB:
sv: :file:`settings.py`-snippet fÃ¶r MySQL och MariaDB:

source: You should also create the ``weblate`` user account in MySQL or MariaDB before you begin the install. Use the commands below to achieve that:
sv: Du bÃ¶r ocksÃ¥ skapa anvÃ¤ndarkontot ``weblate`` i MySQL eller MariaDB innan du pÃ¥bÃ¶rjar installationen. AnvÃ¤nd kommandona nedan fÃ¶r att gÃ¶ra det:

source: Other configurations
sv: Andra konfigurationer

source: Configuring outgoing e-mail
sv: Konfigurera utgÃ¥ende e-post

source: Weblate sends out e-mails on various occasions - for account activation and on various notifications configured by users. For this it needs access to an SMTP server.
sv: Weblate skickar ut e-postmeddelanden vid olika tillfÃ¤llen â fÃ¶r aktivering av konton och olika meddelanden som konfigurerats av anvÃ¤ndarna. FÃ¶r detta behÃ¶ver det tillgÃ¥ng till en SMTP-server.

source: The mail server setup is configured using these settings: :setting:`django:EMAIL_HOST`, :setting:`django:EMAIL_HOST_PASSWORD`, :setting:`django:EMAIL_USE_TLS`, :setting:`django:EMAIL_USE_SSL`, :setting:`django:EMAIL_HOST_USER` and :setting:`django:EMAIL_PORT`. Their names are quite self-explanatory, but you can find more info in the Django documentation.
sv: E-postservern konfigureras med hjÃ¤lp av fÃ¶ljande instÃ¤llningar: :setting:`django:EMAIL_HOST`, :setting:`django:EMAIL_HOST_PASSWORD`, :setting:`django:EMAIL_USE_TLS`, :setting:`django:EMAIL_USE_SSL`, :setting:`django:EMAIL_HOST_USER` och :setting:`django:EMAIL_PORT`. Deras namn Ã¤r ganska sjÃ¤lvfÃ¶rklarande, men du kan hitta mer information i Djangos dokumentation.

source: In case you get error about not supported authentication (for example :samp:`SMTP AUTH extension not supported by server`), it is most likely caused by using insecure connection and server refuses to authenticate this way. Try enabling :setting:`django:EMAIL_USE_TLS` in such case.
sv: Om du fÃ¥r ett felmeddelande om att autentiseringen inte stÃ¶ds (till exempel :samp:`SMTP AUTH-tillÃ¤gg stÃ¶ds inte av servern`), beror det troligen pÃ¥ att du anvÃ¤nder en osÃ¤ker anslutning och servern vÃ¤grar att autentisera pÃ¥ detta sÃ¤tt. FÃ¶rsÃ¶k att aktivera :setting:`django:EMAIL_USE_TLS` i sÃ¥dana fall.

source: :ref:`Configuring outgoing e-mail in Docker container <docker-mail>`
sv: :ref:`Konfigurera utgÃ¥ende e-post i Docker-container <docker-mail>`

source: Running behind reverse proxy
sv: KÃ¶rning bakom omvÃ¤nd proxy

source: Several features in Weblate rely on correct HTTP headers being passed to Weblate. When using reverse proxy, please make sure that the needed information is correctly passed.
sv: Flera funktioner i Weblate Ã¤r beroende av att korrekta HTTP-rubriker skickas till Weblate. NÃ¤r du anvÃ¤nder omvÃ¤nd proxy, se till att nÃ¶dvÃ¤ndig information skickas korrekt.

source: To debug this configuration, you can look at :guilabel:`HTTP environment` in :ref:`manage-performance`.
sv: FÃ¶r att felsÃ¶ka denna konfiguration kan du titta pÃ¥ :guilabel:`HTTP-miljÃ¶` i :ref:`manage-performance`.

source: This is needed for :ref:`rate-limit` or :ref:`audit-log`.
sv: Detta behÃ¶vs fÃ¶r :ref:`rate-limit` eller :ref:`audit-log`.

source: Weblate parses IP address from the ``REMOTE_ADDR``, which is set by the WSGI handler. This might be empty (when using socket for WSGI) or contain a reverse proxy address, so Weblate needs an additional HTTP header with a client IP address.
sv: Weblate analyserar IP-adressen frÃ¥n ``REMOTE_ADDR``, som stÃ¤lls in av WSGI-hanteraren. Denna kan vara tom (vid anvÃ¤ndning av socket fÃ¶r WSGI) eller innehÃ¥lla en omvÃ¤nd proxyadress, sÃ¥ Weblate behÃ¶ver en extra HTTP-header med en klient-IP-adress.

source: Enabling :setting:`IP_BEHIND_REVERSE_PROXY` should be sufficient for the most usual setups, but you might need to adjust :setting:`IP_PROXY_HEADER` and :setting:`IP_PROXY_OFFSET` as well (use :envvar:`WEBLATE_IP_PROXY_HEADER` and :envvar:`WEBLATE_IP_PROXY_OFFSET` in the Docker container).
sv: Att aktivera :setting:`IP_BEHIND_REVERSE_PROXY` bÃ¶r vara tillrÃ¤ckligt fÃ¶r de vanligaste instÃ¤llningarna, men du kan behÃ¶va justera :setting:`IP_PROXY_HEADER` och :setting:`IP_PROXY_OFFSET` ocksÃ¥ (anvÃ¤nd :envvar:`WEBLATE_IP_PROXY_HEADER` och :envvar:`WEBLATE_IP_PROXY_OFFSET` i Docker-containern).

source: This configuration cannot be turned on by default, because it would allow IP address spoofing on installations that don't have a properly configured reverse proxy.
sv: Denna konfiguration kan inte aktiveras som standard, eftersom det skulle mÃ¶jliggÃ¶ra IP-adressfÃ¶rfalskning pÃ¥ installationer som inte har en korrekt konfigurerad omvÃ¤nd proxy.

source: Server host name
sv: Serverns vÃ¤rdnamn

source: The :http:header:`Host` header should match to whatever is configured as :setting:`SITE_DOMAIN`. Additional configuration might be needed in your reverse proxy (for example use ``ProxyPreserveHost On`` for Apache or ``proxy_set_header Host $host;`` with nginx).
sv: :http:header:`Host`-rubriken ska matcha det som Ã¤r konfigurerat som :setting:`SITE_DOMAIN`. Ytterligare konfiguration kan behÃ¶vas i din omvÃ¤nda proxy (anvÃ¤nd till exempel ``ProxyPreserveHost On`` fÃ¶r Apache eller ``proxy_set_header Host $host;`` med nginx).

source: CSRF verification failed errors are often caused by a mismatch between the :http:header:`Host` header and configured :setting:`SITE_DOMAIN`.
sv: Fel vid CSRF-verifiering orsakas ofta av en diskrepans mellan :http:header:`Host`-rubriken och konfigurerade :setting:`SITE_DOMAIN`.

source: Client protocol
sv: Klientprotokoll

source: Not passing correct protocol may cause Weblate to end up in redirection loop trying to upgrade client to HTTPS. Make sure it is correctly exposed by the reverse proxy as :http:header:`X-Forwarded-Proto`.
sv: Om rÃ¤tt protokoll inte godkÃ¤nns kan Weblate hamna i en omdirigeringsloop nÃ¤r det fÃ¶rsÃ¶ker uppgradera klienten till HTTPS. Se till att det exponeras korrekt av den omvÃ¤nda proxyn som :http:header:`X-Forwarded-Proto`.

source: This header then needs to be configured in :setting:`django:SECURE_PROXY_SSL_HEADER` (:file:`settings.py`) or :envvar:`WEBLATE_SECURE_PROXY_SSL_HEADER` (Docker environment).
sv: Denna rubrik mÃ¥ste sedan konfigureras i :setting:`django:SECURE_PROXY_SSL_HEADER` (:file:`settings.py`) eller :envvar:`WEBLATE_SECURE_PROXY_SSL_HEADER` (Docker-miljÃ¶).

source: If you are getting a "Too many redirects" error from the browser, this is most likely caused by mismatch between the actual protocol (HTTPS) and what is observed by Weblate.
sv: Om du fÃ¥r felmeddelandet "FÃ¶r mÃ¥nga omdirigeringar" frÃ¥n webblÃ¤saren beror det troligen pÃ¥ att det faktiska protokollet (HTTPS) inte stÃ¤mmer Ã¶verens med det som Weblate observerar.

source: The protocol proxy headers are automatically handled by :program:`gunicorn` in the default configuration, but other WSGI servers have more secure configuration and require explicit setting of this.
sv: Protokollproxyhuvudena hanteras automatiskt av :program:`gunicorn` i standardkonfigurationen, men andra WSGI-servrar har en sÃ¤krare konfiguration och krÃ¤ver en explicit instÃ¤llning av detta.

source: Since Weblate 5.13 the Docker container is using :program:`granian` and it now requires the explicit configuration of :envvar:`WEBLATE_SECURE_PROXY_SSL_HEADER`.
sv: Sedan Weblate 5.13 anvÃ¤nder Docker-containern :program:`granian` och krÃ¤ver nu en explicit konfiguration av :envvar:`WEBLATE_SECURE_PROXY_SSL_HEADER`.

source: Weblate does execute VCS commands and those accept proxy configuration from environment. The recommended approach is to define proxy settings in :file:`settings.py`:
sv: Weblate utfÃ¶r VCS-kommandon och dessa accepterar proxykonfiguration frÃ¥n miljÃ¶n. Det rekommenderade tillvÃ¤gagÃ¥ngssÃ¤ttet Ã¤r att definiera proxyinstÃ¤llningar i :file:`settings.py`:

source: `Proxy Environment Variables <https://everything.curl.dev/usingcurl/proxies/env.html>`_
sv: `Proxy-miljÃ¶variabler <https://everything.curl.dev/usingcurl/proxies/env.html>`_

source: Adjusting configuration
sv: Justera konfigurationen

source: Copy :file:`weblate/settings_example.py` to :file:`weblate/settings.py` and adjust it to match your setup. You will probably want to adjust the following options:
sv: Kopiera :file:`weblate/settings_example.py` till :file:`weblate/settings.py` och anpassa den efter din konfiguration. Du kommer troligen att vilja justera fÃ¶ljande alternativ:

source: List of site administrators to receive notifications when something goes wrong, for example notifications on failed merges, or Django errors.
sv: Lista Ã¶ver webbplatsadministratÃ¶rer som ska fÃ¥ meddelanden nÃ¤r nÃ¥got gÃ¥r fel, till exempel meddelanden om misslyckade sammanslagningar eller Django-fel.

source: Contact form sends e-mail on these as well unless :setting:`ADMINS_CONTACT` is configured.
sv: KontaktformulÃ¤ret skickar Ã¤ven e-post om dessa, sÃ¥vida inte :setting:`ADMINS_CONTACT` Ã¤r konfigurerat.

source: You need to set this to list the hosts your site is supposed to serve. For example:
sv: Du mÃ¥ste stÃ¤lla in detta fÃ¶r att lista de vÃ¤rdar som din webbplats ska betjÃ¤na. Till exempel:

source: Alternatively you can include wildcard:
sv: Alternativt kan du inkludera jokertecken:

source: Configure how your sessions will be stored. In case you keep the default database backend engine, you should schedule: :command:`weblate clearsessions` to remove stale session data from the database.
sv: Konfigurera hur dina sessioner ska lagras. Om du behÃ¥ller standarddatabasmotorn bÃ¶r du schemalÃ¤gga :command:`weblate clearsessions` fÃ¶r att ta bort gamla sessionsdata frÃ¥n databasen.

source: If you are using Valkey or Redis as cache (see :ref:`production-cache`) it is recommended to use it for sessions as well:
sv: Om du anvÃ¤nder Valkey eller Redis som cache (se :ref:`production-cache`) rekommenderas det att du anvÃ¤nder det Ã¤ven fÃ¶r sessioner:

source: Connectivity to database server, please check Django's documentation for more details.
sv: Anslutning till databasserver, se Djangos dokumentation fÃ¶r mer information.

source: Disable this for any production server. With debug mode enabled, Django will show backtraces in case of error to users, when you disable it, errors will be sent per e-mail to ``ADMINS`` (see above).
sv: Inaktivera detta fÃ¶r alla produktionsservrar. NÃ¤r felsÃ¶kningslÃ¤get Ã¤r aktiverat visar Django backtraces fÃ¶r anvÃ¤ndarna vid fel. NÃ¤r du inaktiverar det skickas felmeddelanden via e-post till ``ADMINS`` (se ovan).

source: Debug mode also slows down Weblate, as Django stores much more info internally in this case.
sv: FelsÃ¶kningslÃ¤get gÃ¶r ocksÃ¥ Weblate lÃ¥ngsammare, eftersom Django lagrar mycket mer information internt i detta fall.

source: E-mail sender address for outgoing e-mail, for example registration e-mails.
sv: E-postadress fÃ¶r utgÃ¥ende e-post, till exempel registreringsmeddelanden.

source: Key used by Django to sign some info in cookies, see :ref:`production-secret` for more info.
sv: Nyckel som anvÃ¤nds av Django fÃ¶r att signera viss information i cookies. Se :ref:`production-secret` fÃ¶r mer information.

source: E-mail used as sender address for sending e-mails to the administrator, for example notifications on failed merges.
sv: E-postadress som anvÃ¤nds som avsÃ¤ndaradress fÃ¶r att skicka e-postmeddelanden till administratÃ¶ren, till exempel meddelanden om misslyckade sammanslagningar.

source: Filling up the database
sv: Fylla databasen

source: After your configuration is ready, you can run :wladmin:`migrate` to create the database structure. Now you should be able to create translation projects using the admin interface.
sv: NÃ¤r konfigurationen Ã¤r klar kan du kÃ¶ra :wladmin:`migrate` fÃ¶r att skapa databasstrukturen. Nu bÃ¶r du kunna skapa Ã¶versÃ¤ttningsprojekt med hjÃ¤lp av administratÃ¶rsgrÃ¤nssnittet.

source: Once you are done, you should also check the :guilabel:`Performance report` in the admin interface, which will give you hints of potential non optimal configuration on your site.
sv: NÃ¤r du Ã¤r klar bÃ¶r du ocksÃ¥ kontrollera :guilabel:`Prestandarapporten` i administratÃ¶rsgrÃ¤nssnittet, som ger dig tips om potentiella icke-optimala konfigurationer pÃ¥ din webbplats.

source: Production setup
sv: ProduktionsuppsÃ¤ttning

source: For a production setup you should carry out adjustments described in the following sections. The most critical settings will trigger a warning, which is indicated by an exclamation mark in the top bar if signed in as a superuser:
sv: FÃ¶r en produktionsmiljÃ¶ bÃ¶r du gÃ¶ra de justeringar som beskrivs i fÃ¶ljande avsnitt. De mest kritiska instÃ¤llningarna utlÃ¶ser en varning, som indikeras med ett utropstecken i den Ã¶vre fÃ¤ltet om du Ã¤r inloggad som superanvÃ¤ndare:

source: It is also recommended to inspect checks triggered by Django (though you might not need to fix all of them):
sv: Det rekommenderas ocksÃ¥ att kontrollera de kontroller som utlÃ¶ses av Django (Ã¤ven om du kanske inte behÃ¶ver Ã¥tgÃ¤rda alla):

source: You can also review the very same checklist at :ref:`manage-performance` in the :ref:`management-interface`.
sv: Du kan ocksÃ¥ granska samma checklista pÃ¥ :ref:`manage-performance` i :ref:`management-interface`.

source: Disable debug mode
sv: Inaktivera felsÃ¶kningslÃ¤ge

source: Disable Django's debug mode (:setting:`DEBUG`) by:
sv: Inaktivera Djangos felsÃ¶kningslÃ¤ge (:setting:`DEBUG`) genom att:

source: With debug mode on, Django stores all executed queries and shows users backtraces of errors, which is not desired in a production setup.
sv: NÃ¤r felsÃ¶kningslÃ¤get Ã¤r aktiverat lagrar Django alla utfÃ¶rda frÃ¥gor och visar anvÃ¤ndarna backtraces av fel, vilket inte Ã¤r Ã¶nskvÃ¤rt i en produktionsmiljÃ¶.

source: Properly configure admins
sv: Konfigurera administratÃ¶rer korrekt

source: Set the correct admin addresses to the :setting:`ADMINS` setting to defining who will receive e-mails in case something goes wrong on the server, for example:
sv: Ange rÃ¤tt administratÃ¶rsadresser i instÃ¤llningen :setting:`ADMINS` fÃ¶r att definiera vem som ska ta emot e-postmeddelanden om nÃ¥got gÃ¥r fel pÃ¥ servern, till exempel:

source: Set correct site domain
sv: StÃ¤ll in rÃ¤tt webbplatsdomÃ¤n

source: Adjust site name and domain in the admin interface, otherwise links in RSS or registration e-mails will not work. This is configured using :setting:`SITE_DOMAIN` which should contain site domain name.
sv: Justera webbplatsens namn och domÃ¤n i administratÃ¶rsgrÃ¤nssnittet, annars kommer lÃ¤nkar i RSS eller registreringsmejl inte att fungera. Detta konfigureras med hjÃ¤lp av :setting:`SITE_DOMAIN` som ska innehÃ¥lla webbplatsens domÃ¤nnamn.

source: Prior to the 4.2 release the Django sites framework was used instead, please see :doc:`django:ref/contrib/sites`.
sv: FÃ¶re version 4.2 anvÃ¤ndes istÃ¤llet Djangos webbplatsramverk, se :doc:`django:ref/contrib/sites`.

source: Correctly configure HTTPS
sv: Konfigurera HTTPS korrekt

source: It is strongly recommended to run Weblate using the encrypted HTTPS protocol. After enabling it, you should set :setting:`ENABLE_HTTPS` in the settings:
sv: Det rekommenderas starkt att kÃ¶ra Weblate med det krypterade HTTPS-protokollet. Efter att ha aktiverat det bÃ¶r du stÃ¤lla in :setting:`ENABLE_HTTPS` i instÃ¤llningarna:

source: You might want to set up HSTS as well, see :ref:`django:security-recommendation-ssl` for more details.
sv: Du kanske ocksÃ¥ vill konfigurera HSTS. Se :ref:`django:security-recommendation-ssl` fÃ¶r mer information.

source: Set properly SECURE_HSTS_SECONDS
sv: StÃ¤ll in SECURE_HSTS_SECONDS korrekt

source: If your site is served over SSL, you have to consider setting a value for :setting:`django:SECURE_HSTS_SECONDS` in the :file:`settings.py` to enable HTTP Strict Transport Security. By default it's set to 0 as shown below.
sv: Om din webbplats anvÃ¤nds via SSL mÃ¥ste du Ã¶vervÃ¤ga att ange ett vÃ¤rde fÃ¶r :setting:`django:SECURE_HSTS_SECONDS` i :file:`settings.py` fÃ¶r att aktivera HTTP Strict Transport Security. Som standard Ã¤r det instÃ¤llt pÃ¥ 0, som visas nedan.

source: If set to a non-zero integer value, the :class:`django:django.middleware.security.SecurityMiddleware` sets the :ref:`django:http-strict-transport-security` header on all responses that do not already have it.
sv: Om den Ã¤r instÃ¤lld pÃ¥ ett heltal som inte Ã¤r noll, stÃ¤ller :class:`django:django.middleware.security.SecurityMiddleware` in :ref:`django:http-strict-transport-security`-rubriken pÃ¥ alla svar som inte redan har den.

source: Setting this incorrectly can irreversibly (for some time) break your site. Read the :ref:`django:http-strict-transport-security` documentation first.
sv: Om du stÃ¤ller in detta felaktigt kan det orsaka irreversibla skador (under en viss tid) pÃ¥ din webbplats. LÃ¤s fÃ¶rst dokumentationen :ref:`django:http-strict-transport-security`.

source: Use a powerful database engine
sv: AnvÃ¤nd en kraftfull databasmotor

source: Please use PostgreSQL for a production environment, see :ref:`database-setup` for more info.
sv: AnvÃ¤nd PostgreSQL fÃ¶r en produktionsmiljÃ¶, se :ref:`database-setup` fÃ¶r mer information.

source: Use adjacent location for running the database server, otherwise the networking performance or reliability might ruin your Weblate experience.
sv: AnvÃ¤nd en nÃ¤rliggande plats fÃ¶r att kÃ¶ra databasservern, annars kan nÃ¤tverksprestandan eller tillfÃ¶rlitligheten fÃ¶rstÃ¶ra din upplevelse av Weblate.
